In [1]:
import pandas as pd

In [2]:
import numpy as np

In [4]:
s = np.array([1,1,2,3])

In [5]:
s

array([1, 1, 2, 3])

In [9]:
s.shape

(4,)

In [6]:
s.reshape(-1,1)

array([[1],
       [1],
       [2],
       [3]])

In [8]:
s.reshape(-1,1).shape

(4, 1)

In [10]:
import re

In [13]:
price = re.search(r'\d*万', "うんたら26万400円ホゲホゲバサfァsdファhsdfじゃあjsl")[0]

In [14]:
price

'26万'

In [31]:
test = pd.DataFrame(
    {'salary': [
        "asdhfoahdfa25万asdfa",
        "asdhfoahdfa22万asdfa",
        pd.np.nan,
        "asdhfoahdfa21万asdfa",
        "asdhfoahdfa20万asdfa",
        "asdhfoahdfa20万asdfa",
        pd.np.nan,
        ]
    } 
)

In [32]:
test

                salary
0  asdhfoahdfa25万asdfa
1  asdhfoahdfa22万asdfa
2                  NaN
3  asdhfoahdfa21万asdfa
4  asdhfoahdfa20万asdfa
5  asdhfoahdfa20万asdfa
6                  NaN

In [33]:
test['salary_value'] = test.salary.str.extract(r'(\d*万)')

In [40]:
def to_float(val):
    if pd.isna(val):
        return val
    return float(val.replace("万", ""))

In [41]:
test["salary_value"].apply(to_float)

0    25.0
1    22.0
2     NaN
3    21.0
4    20.0
5    20.0
6     NaN
Name: salary_value, dtype: float64

In [29]:
test.salary_value.unique()

array(['25万', '22万', '21万', '20万'], dtype=object)